{
    "data" : [
        {
            
        "id": "1",
		"title": "Kasa",
		"context": "Pour Kasa, un leader français de la location d'appartements entre particuliers, j'ai participé à la refonte complète de leur site web en utilisant React et NodeJS.\nJ'ai développé le front-end selon les maquettes Figma, en intégrant des composants React, des animations CSS, et en initialisant l'application avec Create React App.\nJ'ai configuré la navigation entre les pages avec React Router et stylisé l'interface avec Sass.\nCe projet a démontré ma capacité à gérer une refonte complète et à travailler efficacement avec des designs réactifs.",
		"url":"https://kasa-iota-flame.vercel.app/",
        "image": "/public/assets/mockup_devices.png",
        "cover": "/public/assets/kasa_mobile_mockup.png",
        "tags": [
            "Git",
            "CSS",
            "HTML",
            "JSON",
            "SASS",
            "React",
            "Figma",
            "UI/UX",
            "Router",
            "GitHub",
            "Node.js",
            "Animations",
            "JavaScript",
            "Responsive"
		]
        },
        {
            
            "id": "2",
            "title": "Ohmyfood",
            "context": "En tant que développeur junior chez Ohmyfood, une startup en restauration, j'ai développé un site mobile-first répertoriant les menus de restaurants gastronomiques. Le site permet aux clients de composer leurs repas à l'avance, réduisant ainsi les temps d'attente au restaurant.Pour ce projet, j'ai intégré des maquettes mobile et desktop fournies via Figma, en assurant un design responsive. J'ai utilisé Sass pour styliser le site et implémenté des animations CSS pour enrichir l'expérience utilisateur. J'ai également versionné le projet avec Git et GitHub. Ce projet m'a permis de maîtriser l'intégration mobile-first, les animations CSS, et la gestion de version avec Git.",
            "url":"https://p4-oh-my-food-xi.vercel.app/",
            "image": "/public/assets/ohmyfood_mockup_devices.webp",
            "cover": "/public/assets/ohmyfood_desktop_mockup.webp",
            "tags": [
                "Git",
                "CSS",
                "HTML",
                "SASS",
                "Figma",
                "GitHub",
                "UX Design",
                "Animations",
                "JavaScript",
                "Responsive",
                "Mobile-first"
            ]
            },
            {
            
                "id": "3",
                "title": "ArgentBank",
                "context": "Dans ce projet chez ArgentBank, j'ai développé le front-end d'une application web en utilisant React et Redux pour créer une interface utilisateur réactive. Voici ce que j'ai accompli : intégration API, écriture d'appels à l'API REST pour connecter le front-end au back-end; interface utilisateur avec React, création d'un tableau de bord responsive incluant des pages d'accueil, de connexion et de profil, avec des pratiques de Green Code pour optimiser images et composants; gestion des données avec Redux, implémentation de Redux pour gérer l'état global de l'application; modélisation API avec Swagger, conception des routes API pour les transactions, suivant les bonnes pratiques de Swagger.",
                "url":"https://github.com/Dasher8/ArgentBank-website",
                "image": "/public/assets/argent_mockup_devices.webp",
                "cover": "/public/assets/argentbank_ipad.webp",
                "tags": [
                    "Git",
                    "React",
                    "Redux",
                    "GitHub",
                    "Swagger",
                    "Node.js",
                    "API REST",
                    "UX Design",
                    "Green Code",
                    "JavaScript",
                    "Responsive"
                ]
                }
    ]
}

